In [1]:
import pandas as pd

In [2]:
2 * 2

4

In [5]:
car_series = pd.Series(["Bmw", "Porsche", "Honda", "Azera"])
car_series

0        Bmw
1    Porsche
2      Honda
3      Azera
dtype: object

In [9]:
color_series = pd.Series(["Red", "Blue", "Black", "White"])
color_series

0      Red
1     Blue
2    Black
3    White
dtype: object

In [10]:
car_data = pd.DataFrame({"car_data": car_series, "color_data": color_series})
car_data

  car_data color_data
0      Bmw        Red
1  Porsche       Blue
2    Honda      Black
3    Azera      White

In [11]:
car_sales = pd.read_csv("car-sales.csv")

In [12]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [13]:
car_sales.head(2)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00

In [18]:
exported_car_sales = car_sales.to_csv("exported-car-sales.csv")
exported_car_sales

In [19]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [20]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [22]:
car_price_dtype = car_sales.price
car_price_dtype

AttributeError: 'DataFrame' object has no attribute 'price'

In [23]:
car_sales

     Make Colour  Odometer (KM)  Doors        Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [24]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [30]:
car_prices = pd.Series([3000, 2000, 10000, 6500, 7000])
car_prices

0     3000
1     2000
2    10000
3     6500
4     7000
dtype: int64

In [31]:
car_prices.mean()

5700.0

In [33]:
car_sales["Price"].sum()

'$4,000.00 $5,000.00 $7,000.00 $22,000.00 $3,500.00 $4,500.00 $7,500.00 $7,000.00 $6,250.00 $9,700.00 '

In [34]:
car_prices = car_sales["Price"]

In [35]:
car_prices

0     $4,000.00
1     $5,000.00
2     $7,000.00
3    $22,000.00
4     $3,500.00
5     $4,500.00
6     $7,500.00
7     $7,000.00
8     $6,250.00
9     $9,700.00
Name: Price, dtype: object

In [36]:
len(car_sales)

10

In [37]:
len(car_sales["Price"])

10